#include <iostream>

// Реализуйте тип данных массив элементов типа int с проверкой на выход индекса за границы. 
// Размер массива задается при создании массива, массив отводится в динамической памяти.

// Необходимо также перегрузить операцию(и) индексирования [] для чтения или изменения (если объект неконстантный) элементов массива. 
// Допускается использование отрицательных индексов (как в Питоне), где m[-N] — это N-ый с конца элемент. 
// При выходе за границы массива с одной или другой стороны надо напечатать строку "Out of bounds\n" и завершить процесс (exit(0);).

// Перегрузите операцию << для печати элементов массива на стандартный поток вывода последовательно через пробел в одну строку. 
// В конце пробела нет. Ответственностью пользователя является обеспечение того, что все элементы массива инициализированы к моменту печати. 
// Функция не должна создавать лишних копий массива. Функция декларирует, что не будет менять массив.

// Отправлять на проверку надо только описание класса, методов и функций. Реализация будет тестироваться вот с такой функцией main():

class IntArray {
private:
    int * mas;
    int size;

public:
    IntArray(int razm = 0){
        size = razm;
        mas = new int[size];
    }

    IntArray (const IntArray& mass2) : IntArray(mass2.size){
        int i = 0;
        for (i = 0; i < size; ++i) {
            mas[i] = mass2.mas[i];
        }
    }

    int& operator[](int i) const{
        if (i < 0){
            i += size;
        }
        
        if ((i < 0) || (i >= size)){
            std::cout << "Out of bounds\n";
            exit(0);
        }

        return mas[i];
    }

    friend std::ostream& operator<<(std::ostream& out, const IntArray& o) {
        for (int i = 0; i < o.size; ++i) {
            out << o.mas[i];
            if (i + 1 < o.size){
                out << " ";
            }
        }
        return out;
    }

    ~IntArray() {
        delete[] mas;
        size = 0;
    }

};

int main()
{
    int size;
    std::cin >> size;
    IntArray a(size);

    int i = 0, n;
    while(std::cin >> n) {
        a[i++] = n;
    }

    std::cout << a << std::endl;

    const IntArray b(a);
    std::cout << b[-1] << ' ' << b[-2] << ' ' << b[-3] << std::endl;
    std::cout << b[0] << ' ' << b[4] << std::endl;
}
